{
  "extraction_metadata": {
    "date": "2025-11-16T22:50:14.751742",
    "method": "Semantic Scholar API",
    "queries": [
      "student \"web design\"",
      "student \"web programming\"",
      "student \"web development\"",
      "student HTML learning OR education"
    ],
    "filters": {
      "year_min": 2007,
      "year_max": 2025,
      "title_relevance_threshold": 0.8
    },
    "target_count": 64,
    "final_count": 64
  },
  "papers": [
    {
      "id": "2d2505c2fe60e6a8bb254d864af5d726458e268f",
      "title": "A Study on the Current Learning Situation and Enhancement Strategies of Web Design Courses",
      "authors": [
        "Wenqing Kang"
      ],
      "year": 2025,
      "venue": "World Journal of Educational Research",
      "abstract": "With the rapid development of the Internet, the importance of webpage design as an important carrier of information transmission is becoming more and more prominent. However, the current teaching status of web design courses in colleges and universities has many problems, such as lagging teaching content, single teaching method, insufficient practical ability of students, etc. These problems seriously restrict the quality of cultivating web design talents. The purpose of this paper is to analyze the current learning status of web design courses and discuss the enhancement strategies in order to provide reference for improving the teaching quality of web design courses.",
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/2d2505c2fe60e6a8bb254d864af5d726458e268f",
      "doi": "10.22158/wjer.v12n1p72",
      "bibtex": "",
      "pdf_url": "https://doi.org/10.22158/wjer.v12n1p72",
      "pdf_downloaded": false,
      "pdf_path": "",
      "extracted_at": "2025-11-16T22:49:30.126755",
      "source_query": "student \"web design\"",
      "relevance_score": 1.0,
      "rank_score": 40.0
    },
    {
      "id": "051f87d41a4cbf8bbcf002e2430afe3e2711b791",
      "title": "Leveraging Human-in-the-Loop Engagement Through AI in Web Design Education: A Case Study on Adapting to Dynamic Client Requirements",
      "authors": [
        "Jason Lively"
      ],
      "year": 2024,
      "venue": "International Journal of Emerging and Disruptive Innovation in Education : VISIONARIUM",
      "abstract": "The integration of Artificial Intelligence (AI) within educational frameworks, particularly in disciplines such as web design and development, represents a significant evolution in pedagogical strategies. This article examines a unique educational setup where students, while engaging in a web design class, utilize AI tools for text, image, and code creation within a simulated real-world scenario involving a client—dubbed \"Chef Cookie Cutter\". This simulated client interaction introduces unpredictability through mid-assignment requirement changes, thereby mimicking the dynamic nature of real-world web development projects. The focus of this case study is the critical role of human-in-the-loop (HITL) engagement in AI-assisted assignments, where students' adaptability, creativity, and problem-solving skills are put to the test. Such engagement not only prepares students for the intricacies and challenges of their future professions but also emphasizes the importance of human oversight in AI-driven processes. By incorporating generative AI, video avatars, and personalized learning mechanisms, this educational approach fosters a rich, interactive learning environment that enhances digital pedagogy. The findings suggest that integrating HITL in AI assignments significantly improves learning outcomes by fostering an adaptive learning environment that closely mirrors the complexities and demands of the industry, thereby preparing students more effectively for their future careers.",
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/051f87d41a4cbf8bbcf002e2430afe3e2711b791",
      "doi": "10.62608/2831-3550.1016",
      "bibtex": "",
      "pdf_url": "https://digitalcommons.lindenwood.edu/cgi/viewcontent.cgi?article=1016&context=ijedie",
      "pdf_downloaded": true,
      "pdf_path": "/home/user/scholarextractor/data/papers/Lively_2024_Leveraging_Human-in-the-Loop_Engagement_Through_AI.pdf",
      "extracted_at": "2025-11-16T22:49:30.126545",
      "source_query": "student \"web design\"",
      "relevance_score": 1.0,
      "rank_score": 39.0
    },
    {
      "id": "074dab8f6a08a9125ad8d9eac0f84d88af0aa7d4",
      "title": "Development of Learning Using Flipped Classroom Models in Basic Web Programming Subjects at SMK Al Hafidz Leuwiliang",
      "authors": [
        "Luthfia Rifaah",
        "Z. Arief",
        "Rudi Hartono"
      ],
      "year": 2023,
      "venue": "International Journal of Engineering Science and Technology",
      "abstract": "The purpose of this study is the development of basic learning of web programming class XI RPL based on Microsoft teams using the flipped classroom model at SMK Al Hafidz Leuwiliang and to find out its feasibility and effectiveness. The research method used is Research and Development (RD). The learning development model used is the ASSURE learning system design model which is integrated with the PEDATI learning model at the Model Design stage. The subjects of this study were students of class XI RPL. The results of this study based on the results of the feasibility test include (1) the results of testing learning materials obtained a percentage of 78% and are categorized as good; (2) the test results of learning media were 79% and were in the good category; and (3) learning design test results of 83% and categorized as good. One to One test results obtained a percentage of 88% and were classified in the good category, small group test results were categorized as good (85%) and field test results were also in the good category (87%). To determine the effectiveness of learning, it is carried out through testing the N-Gain value from the results of the pre-test and posttest. The result obtained was 0.75 (75%). Based on these values, and the paired test results are  T count   Ttable or 13.72 2.06866 so that through flipped classroom learning can improve the learning outcomes of basic subjects of web programming, because there is a noticeable difference between learning outcomes in pretest and posttest data.",
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/074dab8f6a08a9125ad8d9eac0f84d88af0aa7d4",
      "doi": "10.46328/ijonest.130",
      "bibtex": "",
      "pdf_url": "https://www.ijonest.net/index.php/ijonest/article/download/130/pdf",
      "pdf_downloaded": true,
      "pdf_path": "/home/user/scholarextractor/data/papers/Rifaah_2023_Development_of_Learning_Using_Flipped_Classroom_Mo.pdf",
      "extracted_at": "2025-11-16T22:49:31.030064",
      "source_query": "student \"web programming\"",
      "relevance_score": 1.0,
      "rank_score": 38.0
    },
    {
      "id": "0e961e4608d1feb18b70de3a28ef2b33f0e19c69",
      "title": "Learning Web Programming: Identifying Complex Topics from Student Discussion Forums and Lecture Slides",
      "authors": [
        "Swapna Gottipati",
        "K. Shim",
        "Richie Tan",
        "Zi Rong Tan"
      ],
      "year": 2023,
      "venue": "IEEE Global Engineering Education Conference",
      "abstract": "Designing and delivering web application courses for computing undergraduates is a challenging task. Lack of understanding of web concepts affects the students” interest in web application development. Therefore., faculty employ several traditional strategies including hands on exercises and labs as well as innovative strategies such as videos and discussion forums. However., due to the volume of the posts in the forums., the instructors find it challenging to attend to the students' challenges and focus on more challenging topics across the classroom. In this paper., we propose a text mining based solution to extract the questions and complex topics. We evaluated the solution on the year 2 Web Application course offered to the computing undergraduates. Our experiments show that logistic regression model performs better in classifying question posts and cosine similarity performs better in assigning the topic label to the posts. The findings are visually depicted and are useful to the faculty to identify the topics that requires more attention to improve students' learning.",
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/0e961e4608d1feb18b70de3a28ef2b33f0e19c69",
      "doi": "10.1109/EDUCON54358.2023.10125272",
      "bibtex": "",
      "pdf_url": "",
      "pdf_downloaded": false,
      "pdf_path": "",
      "extracted_at": "2025-11-16T22:49:31.030100",
      "source_query": "student \"web programming\"",
      "relevance_score": 1.0,
      "rank_score": 38.0
    },
    {
      "id": "2f78d92599fb60d7d71d13643e23bd12387b5790",
      "title": "DEVELOPMENT OF WEB PROGRAMMING LEARNING MEDIA USING LARAVEL BASED ON PROJECT BASED LEARNING MODEL IN THE DEPARTMENT OF INFORMATICS AND COMPUTER ENGINEERING FT UNM",
      "authors": [
        "Mustari Lamada",
        "Syahrul Syahrul",
        "Nurul Izzah Qurratu'aini"
      ],
      "year": 2023,
      "venue": "Jurnal nalar pendidikan",
      "abstract": "This research aims to determine the results of developing web programming learning media using Laravel based on the project-based learning model in the Department of Informatics Engineering and Computer Science at UNM that meet the criteria of validity, practicality, and effectiveness. This research used the research and development (R&D) method by applying the ADDIE development model. Data were collected through interviews, questionnaires, tests, and documentation. Two groups of subjects involved in this study were validators, consisting of two expert lecturers, and students of the Department of Informatics Engineering and Computer Science at UNM who took the Web Programming course in 2021, totaling 34 people. Data analysis was performed using descriptive quantitative analysis methods as well as pretest and posttest analysis using prerequisite tests and non-parametric Wilcoxon tests with the assistance of SPSS software version 25. The results of the study show that web programming learning media using Laravel based on the project-based learning model has met the criteria as valid, practical, and effective learning resources. The developed learning media received positive validation from media/system experts with a feasibility rate of 100%. Students' response to this learning media was also positive, with a practicality rate of 84.5%. In addition, the use of this learning media significantly improved students' learning outcomes, as evidenced by an average increase in post-test scores of 67.80%.",
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/2f78d92599fb60d7d71d13643e23bd12387b5790",
      "doi": "10.26858/jnp.v11i2.62852",
      "bibtex": "",
      "pdf_url": "https://doi.org/10.26858/jnp.v11i2.62852",
      "pdf_downloaded": false,
      "pdf_path": "",
      "extracted_at": "2025-11-16T22:49:31.030184",
      "source_query": "student \"web programming\"",
      "relevance_score": 1.0,
      "rank_score": 38.0
    },
    {
      "id": "29439bc1376be0900cd415623c41bce600a00e17",
      "title": "Suitability of Web Development Technology Course in TVET Tertiary Educators’ Perspective",
      "authors": [
        "Hairi Alias",
        "Nuru Mazlia Musa",
        "Fauziah Basok"
      ],
      "year": 2023,
      "venue": "Asian Journal of Vocational Education and Humanities",
      "abstract": "This study will cover on how Web Development technology can be adapted in digital education for higher learning environment from a TVET’s computing lecturers’ perspective including the expectation of learning outcomes by teaching this technology. The respondents have been selected from the computing lecturers of polytechnics and community colleges where both institutions are major players in TVET field. The findings and results have been measured through a questionnaire method involving the information of lecturers’ demographics, duration of working, academic qualification, readiness aspects such as technology suitability, delivery ability, skills and knowledge, certified requirement, and supportive infrastructures. This study also covers in aspects of target and learning outcome for the students in terms of knowledge, teamwork, awareness, and skills. The outcome has stated that most of the respondents agreed that the course is suitable in a tertiary education perspective but with the improvement to the related elements like readiness and infrastructure to meet the needs so the course can be implemented at the optimum level.",
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/29439bc1376be0900cd415623c41bce600a00e17",
      "doi": "10.53797/ajvah.v4i1.2.2023",
      "bibtex": "",
      "pdf_url": "https://journalarsvot.com/index.php/ajvah/article/download/330/275",
      "pdf_downloaded": true,
      "pdf_path": "/home/user/scholarextractor/data/papers/Alias_2023_Suitability_of_Web_Development_Technology_Course_i.pdf",
      "extracted_at": "2025-11-16T22:49:32.069819",
      "source_query": "student \"web development\"",
      "relevance_score": 1.0,
      "rank_score": 38.0
    },
    {
      "id": "2a26e7979c382131a02ddae4b88e12bade9ea440",
      "title": "Design and Build a Web-Based E-Learning Application System at Paramarta Vocational High School",
      "authors": [
        "Iwan Giri Waluyo",
        "Zulfikar Alwi"
      ],
      "year": 2023,
      "venue": "International Journal of Integrative Sciences",
      "abstract": "The conventional learning system is still being implemented at SMK Paramarta, which includes direct contact between teachers and students. However, with the advancement of technology, there is a need for an e-learning system that can facilitate the teaching and learning process and provide more varied learning activities for students. Therefore, this research aims to design and develop a web-based e-learning application system at SMK Paramarta. As a result, when a teacher is unable to attend, the teaching and learning process will be disrupted because there is no other media to deliver learning materials from the teacher to the students. The design of the Web-based E-learning Application System is built using HTML, JavaScript, PHP, MySQL, and CSS to beautify the e-learning pages that will be created. The web-based e-learning application system designed in this research can be an alternative modern and varied learning activity for students at SMK Paramarta. Additionally, this system can also assist teachers in providing learning materials and testing student understanding in a more effective and efficient manner. Therefore, it is hoped that the use of this system can improve the quality of education at SMK Paramarta. To ensure that the application runs smoothly, two testing phases are conducted: white-box testing and black-box testing on the data transfer process that runs within the e-learning application",
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/2a26e7979c382131a02ddae4b88e12bade9ea440",
      "doi": "10.55927/ijis.v2i7.4862",
      "bibtex": "",
      "pdf_url": "https://journal.formosapublisher.org/index.php/ijis/article/download/4862/4965",
      "pdf_downloaded": false,
      "pdf_path": "",
      "extracted_at": "2025-11-16T22:49:32.976294",
      "source_query": "student HTML learning OR education",
      "relevance_score": 1.0,
      "rank_score": 38.0
    },
    {
      "id": "60fe3a7c797e84cb1e21c353492721649cff65d3",
      "title": "The Influence of Learning Coding Interest on Learning Outcomes of Web Programming and Mobile Devices Subjects",
      "authors": [
        "Zahrotun Nafidah",
        "G. Widhanarto"
      ],
      "year": 2020,
      "venue": "",
      "abstract": "Digital startup in indonesia is going rapidly, it caused the need for reliable programmers in challenging of 21st century competences. However, these are not yet fulfilled due to the low interest of students in learning coding. The purpose of this study was to find out how much the influence of learning coding interest on student learning outcomes in the subjects of Web Programming and Mobile Devices conducted at SMK Negeri 8 Semarang. The method used was quantitative research with the type of ex-postfacto research. The population of this study was class XI Software Engineering students totaling 106 students. The study sample was 35 students of class XI Software Engineering 3 using cluster random sampling and data analysis techniques using simple linear regression. The results of the study showed that the learning coding interest variable had a contribution of 43.90% to changes in the variables of student learning outcomes, while the remaining 56.10% was affected by other factors not mentioned in this study. The results of this study are expected to be used as a reference and then followed up in the future learning process in order to improve learning outcomes in related subjects so that the needs of reliable programmers can be fulfilled.",
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/60fe3a7c797e84cb1e21c353492721649cff65d3",
      "doi": "10.4108/eai.29-6-2019.2290445",
      "bibtex": "",
      "pdf_url": "http://eudl.eu/pdf/10.4108/eai.29-6-2019.2290445",
      "pdf_downloaded": true,
      "pdf_path": "/home/user/scholarextractor/data/papers/Nafidah_2020_The_Influence_of_Learning_Coding_Interest_on_Learn.pdf",
      "extracted_at": "2025-11-16T22:49:31.030405",
      "source_query": "student \"web programming\"",
      "relevance_score": 1.0,
      "rank_score": 35.0
    },
    {
      "id": "07ca2e308c77a159cfa83c0a661445302e1e10a0",
      "title": "Collaborative Learning: Design and Reflections in a Web Programming Course",
      "authors": [
        "V. Umadevi"
      ],
      "year": 2016,
      "venue": "",
      "abstract": "Collaborative learning enhances learning achievement and encourages student's responsibility of learning. Student Team Achievement Divisions (STAD) activity is a Collaborative learning in which small groups of students with different learning abilities work together to achieve common learning goal. In this work, design and reflections of STAD activity carried out for teaching a Web Programming course will be discussed. Relevantly, the quantitative and qualitative analysis results obtained by carrying out STAD activity demonstrates the positive impact of this methodology suitable for teaching a Web Programming course.",
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/07ca2e308c77a159cfa83c0a661445302e1e10a0",
      "doi": "10.16920/JEET/2016/V0I0/85667",
      "bibtex": "",
      "pdf_url": "http://www.journaleet.org/index.php/jeet/article/download/85667/65763",
      "pdf_downloaded": false,
      "pdf_path": "",
      "extracted_at": "2025-11-16T22:49:31.030068",
      "source_query": "student \"web programming\"",
      "relevance_score": 1.0,
      "rank_score": 31.0
    },
    {
      "id": "2bf03265fafe1a6f3ab95759b454a03667f361ea",
      "title": "Development of Android-Based Learning Media on Web Programming Subjects at SMK Negeri 1 Ranah Ampek Hulu Tapan",
      "authors": [
        "Monica Wingsky",
        "Heri Mulyono",
        "Faiza Rini",
        "Bernediv Nurdin",
        "Ade Pratama",
        "Rahayu Trisetyowati Untari"
      ],
      "year": 2025,
      "venue": "International journal of multidisciplinary research and analysis",
      "abstract": "The learning process in web programming subjects at SMK Negeri 1 Ranah Ampek Hulu Tapan has not been optimal, this is due to several problems, namely 1) the availability of limited learning media (books), 2) lack of student motivation to learn and 3) lack of understanding of learning materials. This condition causes students' scores to be low. Based on the results of observations, the completeness of students' scores in web programming subjects was 45%. The purpose of this research is to develop and produce valid and practical web programming learning media. The research method used in this study is Research and Development with the ADDIE model. This model consists of 5 stages, namely analysis, develop, design, implementation, and evaluate at each stage. This study involved 20 students in grade XI RPL who participated in web programming learning. The results of this research are in the form of Android-based learning software that can be used as a complement in learning, especially web programming subjects. This learning media has been tested using validity and practicality tests. The validity test of the learning media aspect was carried out by 3 lecturers with an average result of 85.72% and the learning material aspect was carried out by 3 teachers with an average result of 86.22%. Meanwhile, the practicality test was carried out by 2 teachers and 20 students and obtained an average practicality score of 89.15%.",
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/2bf03265fafe1a6f3ab95759b454a03667f361ea",
      "doi": "10.47191/ijmra/v8-i07-59",
      "bibtex": "",
      "pdf_url": "",
      "pdf_downloaded": false,
      "pdf_path": "",
      "extracted_at": "2025-11-16T22:49:31.030166",
      "source_query": "student \"web programming\"",
      "relevance_score": 1.0,
      "rank_score": 30.0
    },
    {
      "id": "36607589b388b201005ab3e7f21a42ab738b537e",
      "title": "Code Simulator Website for Project-Based Learning to Enhance Front-End Development Competence",
      "authors": [
        "Mirna Milasari Milasari",
        "Y. Anistyasari"
      ],
      "year": 2025,
      "venue": "Journal of Education Technology and Information System",
      "abstract": "The platform developed by the researcher, called the \"Code Simulator,\" covers web programming learning materials, including HTML, CSS, and JavaScript. The application, which integrates HTML, CSS, and JavaScript programming languages with a website-based code simulator, is a type of software designed to assist students in organizing and evaluating the programming materials taught by teachers through projects in a Project-Based Learning model. This study aims to determine the learning outcomes competency of students after using the Techcode application and applying the project-based learning model in web programming lessons. This research used a quantitative pretest-posttest method. The research design used is the ADDIE method with a prototype development model. The target of this research is students of class XI RPL at SMK PGRI 2 Sidoarjo. The instruments used include validation sheets for learning tools, pretest-posttest question validation sheets, material validation sheets, and question validation sheets. The research results show that the percentage of material validation was 92.5%, Rencana Pelaksanaan Pembelajaran (RPP) validation was 89%, pretest-posttest question validation was 90%, and media or learning tools validation was 95.5%. Based on the results of the T-test, the significance value obtained was <0.001, which means 0.001 < 0.05, so H₀ is rejected and H₁ is accepted. Therefore, it can be concluded that the use of a website-based learning media can improve students' learning outcome competencies in learning web programming.",
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/36607589b388b201005ab3e7f21a42ab738b537e",
      "doi": "10.26740/jetis.v1i01.35642",
      "bibtex": "",
      "pdf_url": "",
      "pdf_downloaded": false,
      "pdf_path": "",
      "extracted_at": "2025-11-16T22:49:31.030217",
      "source_query": "student \"web programming\"",
      "relevance_score": 1.0,
      "rank_score": 30.0
    },
    {
      "id": "389447e1318af795a5165db942ea4072b63ce21e",
      "title": "IMPROVING WEB PROGRAMMING COMPETENCE THROUGH LARAVEL BOOTCAMP FOR VOCATIONAL HIGH SCHOOL STUDENTS",
      "authors": [
        "Syafrial Fachri Pane",
        "Nyi Raden Nuraini Siti Fathonah",
        "Amri Yanuar",
        "Raden Irfan Santika Rahman",
        "Rifky Najra Adipura",
        "Risyad Ridwansyah",
        "Ode Andi Alamsyah",
        "Hafizh Fakhri Muharram",
        "Rendy Kamaluddin"
      ],
      "year": 2025,
      "venue": "MERPATI",
      "abstract": "The rapid development of digital technology requires vocational high school graduates to master practical competencies that align with current industrial needs. However, initial observations at SMK Negeri 2 Cimahi revealed that students in the Software Engineering department were still dependent on procedural programming and had very limited exposure to modern frameworks such as Laravel. This competence gap resulted in low readiness to face professional challenges in web development. To address this issue, a community service program was implemented in the form of a Laravel bootcamp that applied a project-based learning approach. The program involved 40 students who were guided through structured activities including technical preparation, introduction to Laravel concepts, project development of a To-Do List application, and comprehensive evaluation. The evaluation results demonstrated clear improvement, with the average pre-test score of 46.25 increasing to 72.80 in the post-test. Further analysis of competency achievement showed that 85% of participants understood the MVC concept, 90% successfully implemented CRUD functions, 80% mastered authentication, 75% presented projects effectively, and 88% demonstrated strong teamwork. These outcomes confirm that project-based bootcamps can effectively bridge the gap between theory and practice, while strengthening technical competence and enriching teaching resources available for schools and higher education institutions.",
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/389447e1318af795a5165db942ea4072b63ce21e",
      "doi": "10.36618/merpati.v7i1.4520",
      "bibtex": "",
      "pdf_url": "",
      "pdf_downloaded": false,
      "pdf_path": "",
      "extracted_at": "2025-11-16T22:49:31.030225",
      "source_query": "student \"web programming\"",
      "relevance_score": 1.0,
      "rank_score": 30.0
    },
    {
      "id": "413069f431000b7ab0682e3ab19aa0ee4364daea",
      "title": "Students' perceptions of peer assessment in a Web programming course: Reflections on feedback, learning, and professional improvement",
      "authors": [
        "Jelena Matejić"
      ],
      "year": 2025,
      "venue": "Journal of Educational Studies in Mathematics and Computer Science",
      "abstract": "This paper examines students' perceptions and attitudes toward peer feedback within the course Introduction to Web Programming. The primary aim is to explore how students perceive the contribution of peer evaluation to the enhancement of their projects, the development of reflective thinking, and the strengthening of professional competencies. The research was conducted after the completion of student projects and the peer assessment phase, using a post-activity survey distributed to participating students. The survey was specifically designed to capture students' attitudes and experiences regarding various aspects of the peer feedback process. Responses were analyzed across several categories: technical correctness, visual quality, content relevance of feedback, presentation skills, emotional responses to feedback, sincerity, and reflective engagement. Findings indicate that students generally viewed both giving and receiving peer comments as useful for improving project quality and supporting personal development, especially in relation to evaluation and self-evaluation skills. Moreover, students reported that peer feedback contributed to their critical thinking, boosted self-confidence, and fostered more constructive academic communication. Based on these insights into student perspectives, the study proposes guidelines for the further implementation and improvement of peer assessment practices in technology-related educational settings.",
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/413069f431000b7ab0682e3ab19aa0ee4364daea",
      "doi": "10.5937/jesmac2501056m",
      "bibtex": "",
      "pdf_url": "",
      "pdf_downloaded": false,
      "pdf_path": "",
      "extracted_at": "2025-11-16T22:49:31.030271",
      "source_query": "student \"web programming\"",
      "relevance_score": 1.0,
      "rank_score": 30.0
    },
    {
      "id": "643359f8d70af9d9b0720c70f82e9696d6409f93",
      "title": "Implementation of Test-Driven Approach to Empower Self-Learning in PHP Web Programming Practice",
      "authors": [
        "Y. Syaifudin",
        "Triana Fatmawati",
        "Amal Dermawan Udjir",
        "P. Saputra",
        "Nobuo Funabiki",
        "Mustika Mentari",
        "Chandrasena Setiadi",
        "A. Rahmadani"
      ],
      "year": 2025,
      "venue": "International Scientific Journal of Computing",
      "abstract": "Web applications have become immensely popular and widely utilized across various sectors due to their accessibility, scalability, and ability to provide real-time updates, driving the demand for skilled web programmers. Approximately 75.9% of websites that use server-side languages rely on PHP, a widely adopted and flexible scripting language that integrates seamlessly with databases, making it suitable for dynamic website development. As the complexity of web development increases, self-learning systems become essential for fostering independent programming skills through platforms such as learning management systems (LMS) and MOOCs; however, many of these tools still require human intervention for code verification and lack automated feedback mechanisms. This study proposes a self-learning framework that leverages test-driven development (TDD) to enhance PHP programming education. The framework enables students to participate in structured learning modules, receive realtime feedback, and refine their coding abilities. An evaluation with 150 first-year IT students in Indonesia demonstrated a 100% success rate in all modules, where success was defined as the ability of students to pass all test cases in the predefined test suites after multiple attempts. This highlights the framework’s effectiveness while also noting areas for improvement in content depth and instructional clarity.",
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/643359f8d70af9d9b0720c70f82e9696d6409f93",
      "doi": "10.47839/ijc.24.2.4015",
      "bibtex": "",
      "pdf_url": "",
      "pdf_downloaded": false,
      "pdf_path": "",
      "extracted_at": "2025-11-16T22:49:31.030415",
      "source_query": "student \"web programming\"",
      "relevance_score": 1.0,
      "rank_score": 30.0
    },
    {
      "id": "2e8f54184e7af66c2f42876ef8a6e6fdd129dfac",
      "title": "Development of an Interactive Method for Training It Students on The Topic Of \"Website Optimization\"",
      "authors": [
        "Rasulova Tursunoy Paziljanovna"
      ],
      "year": 2025,
      "venue": "European International Journal of Pedagogics",
      "abstract": "The article presents the development and testing of an interactive teaching method for students on the topic of \"Website Performance Optimization.\" The method is focused on a practice-oriented approach, active student involvement, and the use of professional audit tools. The proposed methodology combines the use of real-life cases, digital simulators, gamification, and independent solution design. The results of implementing the method demonstrate an increase in technical competence and motivation among students to study complex topics in web development.",
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/2e8f54184e7af66c2f42876ef8a6e6fdd129dfac",
      "doi": "10.55640/eijp-05-08-16",
      "bibtex": "",
      "pdf_url": "",
      "pdf_downloaded": false,
      "pdf_path": "",
      "extracted_at": "2025-11-16T22:49:32.069859",
      "source_query": "student \"web development\"",
      "relevance_score": 1.0,
      "rank_score": 30.0
    },
    {
      "id": "324f0bf49b85cb650459c7caf11db4d9cef1d651",
      "title": "Empowering Independent Learning in Web Development Using Intelligent Tutoring Systems",
      "authors": [
        "Danny Wiselee",
        "Anglie Yanto",
        "Laurens Spits Warnars",
        "H. Warnars",
        "Fariza Hanis Abdul Razak"
      ],
      "year": 2025,
      "venue": "International Conference on Communications and Information Technology",
      "abstract": "The increasing demand for flexible and self-paced learning in higher education has underscored the need for intelligent digital tools that support autonomous study, particularly in foundational technical domains such as web development. This study aims to design and implement an Intelligent Tutoring System (ITS) to facilitate independent learning among undergraduate students in basic web development courses. The ITS was developed using the Laravel framework and integrated with a MySQL database, incorporating client-side and serverside programming components to deliver structured instructional content, interactive exercises, and automated feedback. A structured software development methodology, including requirements analysis, system design through use case and class diagrams, and iterative interface prototyping via Figma, guided the development process. The ITS was designed to supplement existing e-learning platforms and is intended to enhance accessibility, self-regulation, and learner engagement, particularly for students needing to review or retake the course material. Preliminary implementation results suggest that the system supports autonomous learning by providing modular course content, instructor-curated assessments, and a user-friendly interface. The platform also includes feedback mechanisms to continuously refine the instructional material based on learner input. The findings indicate that Intelligent Tutoring Systems have the potential to improve student outcomes by fostering independent learning habits and providing scalable instructional support in computer science education. This research contributes to the advancement of personalized e-learning technologies and offers a practical framework for ITS development in resource-constrained academic environments.",
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/324f0bf49b85cb650459c7caf11db4d9cef1d651",
      "doi": "10.1109/ICCIT65724.2025.11166728",
      "bibtex": "",
      "pdf_url": "",
      "pdf_downloaded": false,
      "pdf_path": "",
      "extracted_at": "2025-11-16T22:49:32.069913",
      "source_query": "student \"web development\"",
      "relevance_score": 1.0,
      "rank_score": 30.0
    },
    {
      "id": "45a613574ce87f13e02fde52cd6e63e7d8abd97c",
      "title": "Gamifying Coding Education for Beginners: Empowering Learners with HTML, CSS and JavaScript",
      "authors": [
        "Santhush Chandrasekara",
        "Dileep Hewavitharana",
        "Maleesha Weerasinghe",
        "Binod Gayasri",
        "D. Wijendra",
        "Dilshan I. de Silva"
      ],
      "year": 2025,
      "venue": "International Conference on Soft Computing and Software Engineering",
      "abstract": "Traditional coding education often fails to engage and motivate beginners due to its lack of interactivity and personalized learning experiences. This paper presents a gamified learning platform designed to teach Hypertext Markup Language (HTML), Cascading Style Sheets (CSS), and JavaScript (JS) to beginners. The platform incorporates interactive lessons, AI (Artificial Intelligence)-powered coding assistance, and advanced gamification mechanics to enhance learner motivation, engagement, and success. Furthermore, key features include performance-based recommendation engines, virtual coding environments with real-time feedback, and a collaborative platform for peer interactions. The integration of AI provides personalized feedback and adaptive learning paths, while gamified elements such as badges, points, and leaderboards foster competitive and enjoyable experiences. Preliminary findings demonstrate a 40% increase in student engagement metrics and a 35% improvement in coding competency compared to traditional methods. This research lays the groundwork for future expansion to additional programming languages and broader educational applications, with potential implications for transforming computer science education on a scale.",
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/45a613574ce87f13e02fde52cd6e63e7d8abd97c",
      "doi": "10.1109/SCSE65633.2025.11030977",
      "bibtex": "",
      "pdf_url": "",
      "pdf_downloaded": false,
      "pdf_path": "",
      "extracted_at": "2025-11-16T22:49:32.976393",
      "source_query": "student HTML learning OR education",
      "relevance_score": 1.0,
      "rank_score": 30.0
    },
    {
      "id": "25575afbb31d80bfff74b0bcac5fc4ce44fed4d5",
      "title": "Exploration of the Ideological and Political Education in the “Web Design and Website Construction” Course",
      "authors": [
        "Yiyong Ye"
      ],
      "year": 2024,
      "venue": "Journal of Contemporary Educational Research",
      "abstract": "“Web Design and Website Construction” is a core professional course for e-commerce majors. This article explores how to integrate ideological and political education into the curriculum teaching of the course from three aspects: the necessity of ideological and political education construction, the construction goals, and the implementation paths. It not only improves students’ professional and technical skills, but also guides students to establish a correct outlook on life and values, and cultivates students’ comprehensive development of comprehensive literacy.",
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/25575afbb31d80bfff74b0bcac5fc4ce44fed4d5",
      "doi": "10.26689/jcer.v8i7.7805",
      "bibtex": "",
      "pdf_url": "",
      "pdf_downloaded": false,
      "pdf_path": "",
      "extracted_at": "2025-11-16T22:49:30.126726",
      "source_query": "student \"web design\"",
      "relevance_score": 1.0,
      "rank_score": 29.0
    },
    {
      "id": "4f4abea8e7e44642d28a32d12a14e4b923c24ee3",
      "title": "Comparative Study of Facial Expression Recognition Using Facial Landmark in e-Learning System",
      "authors": [
        "F. Bachtiar",
        "Cesilia Natasya Nainggolan",
        "Riza Setiawan Soetedjo",
        "R. I. Rokhmawati",
        "Lailil Muflikhah"
      ],
      "year": 2024,
      "venue": "2024 11th International Conference on Electrical Engineering, Computer Science and Informatics (EECSI)",
      "abstract": "The e-Iearning system or distance learning system has become important, especially during the COVID-19 pan-demic. Several tertiary institutions have made the e-Iearning system an alternative teaching and learning activity. Research on the use of e-Iearning needs to be explored to obtain innovative, creative, and fun learning. One aspect that can be examined in e-learning is students' emotional response to the learning activities. The emotional state of students directly or indirectly affects the learning process. The student's emotional responses can be measured by their facial expressions. In this study, an exploration was carried out on the facial expressions shown by students in HSS Learning, an e-Iearning for learning web programming. The student's facial expressions were extracted using 68 pairs of facial landmarks and additional 6 facial feature vectors. The total number of features used is 142. Machine learning methods for classification are applied to determine the performance of several classification models, including the k-Nearest Neighbor (k- NN) algorithm, Logistic Regression, and Support Vector Machine (SVM). Machine learning performance evaluation is done using the Fl-score and confusion matrix. The results show that the accuracy of the k-NN, Logistic Regression, and SVM are 91.4%, 92.2%, and 92.1 %, respectively. However, the Fl-score macro values are relatively low due to data imbalance with the k- NN, Logistic Regression, and SVM models are 0.250, 0.272, and 0.243, respectively. While the study provides insight into the student learning experience in e-Iearning settings, this study needs to be explored more.",
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/4f4abea8e7e44642d28a32d12a14e4b923c24ee3",
      "doi": "10.1109/EECSI63442.2024.10776068",
      "bibtex": "",
      "pdf_url": "",
      "pdf_downloaded": false,
      "pdf_path": "",
      "extracted_at": "2025-11-16T22:49:31.030326",
      "source_query": "student \"web programming\"",
      "relevance_score": 1.0,
      "rank_score": 29.0
    },
    {
      "id": "255a21fe9bce890570b7483ef45bea9428ea5629",
      "title": "A Design of Phrase Fill-in-Blank Problem in JavaScript-Based Web-Client Programming Learning Assistant System",
      "authors": [
        "Huiyu Qi",
        "Zhikang Li",
        "Nobuo Funabiki",
        "Wen-chung Kao"
      ],
      "year": 2024,
      "venue": "International Conference on Computational Intelligence and Intelligent Systems",
      "abstract": "JavaScript-based web-client programming including HTML, CSS, and JavaScript is taught to students in introductory web development courses in universities worldwide. To assist self-studies of novice students, we have developed the JavaScript-based web-client programming learning assistant system (JSPLAS). It offers various types of exercise problems with different learning goals, where any answer from a student is automatically marked in the system. In this paper, we present a design of the phrase fill-in-blank problem (PFP) in JSPLAS. A PFP instance provides a source code for web-client programming where several phrases are blanked out, and requests students to fill them in correctly. A phrase consists of one or multiple elements in the code. The correctness of any answer is verified through string matching with the original phrase. In future works, we will generate PFP instances for basic web-client programming concepts and assign them to students for comprehensive evaluations of the proposal. Besides, we will implement the automatic generation program of a new PFP instance to assist teachers.",
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/255a21fe9bce890570b7483ef45bea9428ea5629",
      "doi": "10.1145/3708778.3708799",
      "bibtex": "",
      "pdf_url": "",
      "pdf_downloaded": false,
      "pdf_path": "",
      "extracted_at": "2025-11-16T22:49:32.069764",
      "source_query": "student \"web development\"",
      "relevance_score": 1.0,
      "rank_score": 29.0
    },
    {
      "id": "3e6bd5993bbaf2412de114a78e4480a4e7487005",
      "title": "DESIGN AND CONSTRUCTION OF E-LEARNING MEDIA MOBILE BASED USING ANDROID STUDIO",
      "authors": [
        "Harun Aminuddin",
        "Nirsal Nirsal"
      ],
      "year": 2024,
      "venue": "Jurnal Teknik Informatika (Jutif)",
      "abstract": "In the increasingly developing digital era, technological transformation has had a significant impact on various sectors, including education. This phenomenon gives rise to a new paradigm in the teaching and learning process, which is specifically known as educational technology or e-learning. This research aims to design an e-learning application. The main aim of this application is so that schools can keep up with technological developments that are developing rapidly in the world of education and also make it easier for teachers and students to provide information and increase learning hours that can be accessed by teachers and students anytime and anywhere. The type of research used is the Research and Development (R&D) method. The application development model used in this research involves four stages, namely observation, interviews and literature study. The application used in the creation system is Android Studio. The programming languages ​​used in designing this e-learning are HTML/CSS, PHP, Java Script and Kotlin. The result of this research is an application used by teachers and students at SDN 7 Ponjalae in the teaching and learning process using an electronic learning system to make it easier to access learning anywhere and anytime. This e-learning application has been tested using a black box by obtaining media expert validation test results of 3.90, including in the Very Good category.",
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/3e6bd5993bbaf2412de114a78e4480a4e7487005",
      "doi": "10.52436/1.jutif.2024.5.4.2163",
      "bibtex": "",
      "pdf_url": "",
      "pdf_downloaded": false,
      "pdf_path": "",
      "extracted_at": "2025-11-16T22:49:32.976363",
      "source_query": "student HTML learning OR education",
      "relevance_score": 1.0,
      "rank_score": 29.0
    },
    {
      "id": "5b6d26f70c3f90067f4803d1ed57e4e43de64c5d",
      "title": "Web-Based E-Learning Application For Mathematics And Indonesian Language Subjects At Sman 4 South Tangerang Using Html And Php",
      "authors": [
        "Desy Diana",
        "Munich Heindari Ekasari"
      ],
      "year": 2024,
      "venue": "Journal of Renewable Engineering",
      "abstract": "This project develops a web-based e-learning application for Mathematics and Indonesian subjects at SMAN 4 South Tangerang, using HTML and PHP as the main platform. The main goal of this app is to provide interactive and easily accessible educational resources that enhance the learning and teaching process. The app is designed to meet the specific needs of students and teachers, enriching the learning experience through customizable content and interactive features. In this study, we analyzed the effectiveness of the app in terms of increasing student engagement and learning efficiency. The development method involves requirements analysis, system design, implementation, and testing. Usability and accessibility testing is carried out to ensure that the application can be used easily by all students, including those with special needs. The results of using the application show a significant increase in student learning motivation and academic performance, especially in Mathematics and Indonesian. Teachers also reported improvements in classroom management and teaching effectiveness. Despite this, the application still requires some improvements regarding scalability and data security. In conclusion, this e-learning application has been successful in facilitating a more dynamic and supportive learning environment at SMAN 4 South Tangerang. This project offers important insights into how technology can be leveraged to improve the quality of education.",
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/5b6d26f70c3f90067f4803d1ed57e4e43de64c5d",
      "doi": "10.62872/8jd9jp85",
      "bibtex": "",
      "pdf_url": "",
      "pdf_downloaded": false,
      "pdf_path": "",
      "extracted_at": "2025-11-16T22:49:32.976456",
      "source_query": "student HTML learning OR education",
      "relevance_score": 1.0,
      "rank_score": 29.0
    },
    {
      "id": "031d01bde6fe434cca255b9593e2660c9b1fb5bd",
      "title": "Development of Learning Media Innovation for Android-Based Web Programming Courses",
      "authors": [
        "Muhammad Alam Nur Haris",
        "Mustari Lamada",
        "S. Syamsurijal"
      ],
      "year": 2023,
      "venue": "Journal of Research and Innovation",
      "abstract": "This study aims to develop a learning media for the Android-based web programming course and evaluate the validity, practicality, and effectiveness of the learning media. The Research & Development (R&D) method was used with the Analysis, Design, Development, Implementation, & Evaluation (ADDIE) model. The research subjects consisted of 39 students from the Computer Science and Informatics Education Program who took the web programming course in the odd semester of the 2022/2023 academic year. Data was collected through validation sheets, questionnaires, and test sheets. The results showed that the Android-based learning media product developed had high validity according to expert assessments, effective criteria that met high interpretation, and practicality based on the analysis of student responses to the learning media. Therefore, it can be concluded that the Android-based learning media for the web programming course is feasible to use with the categories of validity, practicality, and effectiveness in the learning process in the Computer Science and Informatics Education Program, Department of Computer Science and Informatics, Faculty of Engineering, Makassar State University, in the Web Programming course.",
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/031d01bde6fe434cca255b9593e2660c9b1fb5bd",
      "doi": "10.59562/jorein.v1i2.50271",
      "bibtex": "",
      "pdf_url": "",
      "pdf_downloaded": false,
      "pdf_path": "",
      "extracted_at": "2025-11-16T22:49:31.030037",
      "source_query": "student \"web programming\"",
      "relevance_score": 1.0,
      "rank_score": 28.0
    },
    {
      "id": "4409895973801a21dc8f9852f2ca5d4d08bfcea9",
      "title": "Responsive Web Design Learning Media: Enhancing Student Independence in Vocational Web Programming",
      "authors": [
        "Wira Tri Yoga",
        "K. Kusumadyahdewi",
        "Wahyu Mulyo Utomo"
      ],
      "year": 2023,
      "venue": "Letters in Information Technology Education (LITE)",
      "abstract": "The main objective of this learning media development is to develop Responsive Web Design (RWD) based learning media with the Pomodoro learning technique on web programming. The learning media is used to create learning media that is not monotonous, and students can learn independently with features such as Pomodoro time management, monitoring material that has been learned, live coding to learn coding practices, and quizzes to monitor student understanding. This research and development uses the Plomp development model reference, which consists of 5 stages, namely (1) preliminary investigation, (2) design phase, (3) realisation/construction phase, (4) test, evaluation, and revision phase, and (5) implementation phase. Products that have been produced in the form of Responsive Web Design (RWD) learning media with the name WCode. The results of the material expert validation assessment were 78.87 percent, media validation was 92.71 percent, development trials (small groups) were 87.36 percent, field trials (large groups) were 90.02 percent, the level of student learning independence after using the media was 79.38 percent with an increase of 12.99 percent from the level of student learning independence before using the learning media made. Overall, the learning media made can be considered feasible and used as a means of student learning materials in class and supporting independent student learning on web programming elements for vocational students majoring in Software Engineering.",
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/4409895973801a21dc8f9852f2ca5d4d08bfcea9",
      "doi": "10.17977/um010v6i22023p64-69",
      "bibtex": "",
      "pdf_url": "",
      "pdf_downloaded": false,
      "pdf_path": "",
      "extracted_at": "2025-11-16T22:49:31.030284",
      "source_query": "student \"web programming\"",
      "relevance_score": 1.0,
      "rank_score": 28.0
    },
    {
      "id": "2fe20aea6111a5e1328e4680c553698567ff226c",
      "title": "The blended teaching practice in the web development fundamentals course",
      "authors": [
        "Changli Feng",
        "Haiyan Wei",
        "Xueming Bai",
        "Sai Qiao",
        "Xiaorong Zhu",
        "Jing Liu"
      ],
      "year": 2023,
      "venue": "",
      "abstract": null,
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/2fe20aea6111a5e1328e4680c553698567ff226c",
      "doi": "",
      "bibtex": "",
      "pdf_url": "",
      "pdf_downloaded": false,
      "pdf_path": "",
      "extracted_at": "2025-11-16T22:49:32.069882",
      "source_query": "student \"web development\"",
      "relevance_score": 1.0,
      "rank_score": 28.0
    },
    {
      "id": "06f9d750bc1801082723eb3e8d5ad5f9bb4d3b35",
      "title": "Reform of the web design and construction teaching",
      "authors": [
        "Haibo Wang",
        "Weina Zhang"
      ],
      "year": 2012,
      "venue": "National Conference for Engineering Sciences",
      "abstract": "This paper puts forward reform method for the web design and construction teaching from three aspects. Based on computational thinking, we redesigned guiding principle in HTML element and CSS layout teaching, emphasized on abstraction and automation. Establish a real development environment of website which can make students comprehend the real process in the website building. Adopted more tools for analyze web page which provide powerful function to students. These tools help students to acquire experience from mature web page. These reforms have been proved to be effective in web design and construction teaching.",
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/06f9d750bc1801082723eb3e8d5ad5f9bb4d3b35",
      "doi": "10.1109/NCES.2012.6543602",
      "bibtex": "",
      "pdf_url": "https://doi.org/10.2991/icetms.2013.153",
      "pdf_downloaded": false,
      "pdf_path": "",
      "extracted_at": "2025-11-16T22:49:30.126553",
      "source_query": "student \"web design\"",
      "relevance_score": 1.0,
      "rank_score": 27.0
    },
    {
      "id": "0e69b49cd93b0421f68be38bb26e24dc23da94da",
      "title": "An Event Listener or an Event Handler? Students Explain Event-drivenness in JavaScript",
      "authors": [
        "Aleksi Lukkarinen",
        "T. Lehtinen",
        "Lassi Haaranen",
        "L. Malmi"
      ],
      "year": 2021,
      "venue": "",
      "abstract": null,
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/0e69b49cd93b0421f68be38bb26e24dc23da94da",
      "doi": "",
      "bibtex": "",
      "pdf_url": "",
      "pdf_downloaded": false,
      "pdf_path": "",
      "extracted_at": "2025-11-16T22:49:32.069583",
      "source_query": "student \"web development\"",
      "relevance_score": 1.0,
      "rank_score": 26.0
    },
    {
      "id": "2e7a74df4bd72436b11d9968c9e5d595afd43cc1",
      "title": "INTEGRATING A SERVICE LEARNING PROJECT INTO AN ADVANCED WEB DEVELOPMENT COURSE",
      "authors": [],
      "year": 2011,
      "venue": "",
      "abstract": "Student success is a growing concern in higher education institutions. How can educators create courses that better prepare students for their future careers? The purpose of this paper is to present recommendations that will assist educators in helping students to be successful in college. This paper begins by briefly discussing a service-learning project (SLP). Next, the paper compares the advantages and disadvantages of completing a simulated project against a service-learning project in a web development course from a teacher’s perspective. Additionally, this paper explores the students’ and clients’ perceptions of the advantages and disadvantages of SLPs. This paper also outlines a model for teaching a web development course with the integration of a service-learning project. Finally, the paper concludes with the idea that community service-based projects can benefit all parties involved and should be considered when designing the pedagogy for an advanced web development course. This study, along with others referenced in the paper, finds that service-learning projects provide a framework for structuring an effective course curriculum.",
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/2e7a74df4bd72436b11d9968c9e5d595afd43cc1",
      "doi": "10.48009/2_iis_2011_22-29",
      "bibtex": "",
      "pdf_url": "https://doi.org/10.48009/2_iis_2011_22-29",
      "pdf_downloaded": true,
      "pdf_path": "/home/user/scholarextractor/data/papers/Unknown_2011_INTEGRATING_A_SERVICE_LEARNING_PROJECT_INTO_AN_ADV.pdf",
      "extracted_at": "2025-11-16T22:49:32.069849",
      "source_query": "student \"web development\"",
      "relevance_score": 1.0,
      "rank_score": 26.0
    },
    {
      "id": "25717e5f386d2fe2bc31401bd40c9ae2e8c38eb1",
      "title": "\"Unboxing the Sandbox\": A New Method of Learning PHP Advanced Web Programming",
      "authors": [
        "Mohamad Rahimi",
        "M. Rosman",
        "M. A. Aziz",
        "Mohd Akmal",
        "Faiz Osman"
      ],
      "year": 2020,
      "venue": "",
      "abstract": null,
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/25717e5f386d2fe2bc31401bd40c9ae2e8c38eb1",
      "doi": "",
      "bibtex": "",
      "pdf_url": "",
      "pdf_downloaded": false,
      "pdf_path": "",
      "extracted_at": "2025-11-16T22:49:31.030137",
      "source_query": "student \"web programming\"",
      "relevance_score": 1.0,
      "rank_score": 25.0
    },
    {
      "id": "584993d27fc55e29391545492d87d3ab244e4bf9",
      "title": "Investigating a new approach for teaching the JavaScript DOM",
      "authors": [
        "Seán Doyle"
      ],
      "year": 2020,
      "venue": "",
      "abstract": null,
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/584993d27fc55e29391545492d87d3ab244e4bf9",
      "doi": "10.25316/IR-15258",
      "bibtex": "",
      "pdf_url": "",
      "pdf_downloaded": false,
      "pdf_path": "",
      "extracted_at": "2025-11-16T22:49:31.030352",
      "source_query": "student \"web programming\"",
      "relevance_score": 1.0,
      "rank_score": 25.0
    },
    {
      "id": "28e25271fb10fdff126cbea8f8dd474e2cff0f6a",
      "title": "Lozinskaya A. M., Yahabipova I. M. COMPARATIVE ANALYSIS OF ON-LINE SERVICES FOR TEACHING SCHOOL STUDENTS WEB PROGRAMMING",
      "authors": [
        "Удк",
        "Лозинская А.М",
        "Яхабипова И.М",
        "Сравнительный Анализ",
        "ON-LINE Сервисов",
        "Для Обучения",
        "Школьников WEB-ПРОГРАММИРОВАНИЮ"
      ],
      "year": 2018,
      "venue": "",
      "abstract": null,
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/28e25271fb10fdff126cbea8f8dd474e2cff0f6a",
      "doi": "",
      "bibtex": "",
      "pdf_url": "",
      "pdf_downloaded": false,
      "pdf_path": "",
      "extracted_at": "2025-11-16T22:49:31.030154",
      "source_query": "student \"web programming\"",
      "relevance_score": 1.0,
      "rank_score": 23.0
    },
    {
      "id": "2f0f46613f6531a03872c89cabec6b93ea61bd0c",
      "title": "Development and Assessment of E-Learning Software and Instructional Training Devices",
      "authors": [
        "Eunice B. Custodio"
      ],
      "year": 2018,
      "venue": "",
      "abstract": null,
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/2f0f46613f6531a03872c89cabec6b93ea61bd0c",
      "doi": "",
      "bibtex": "",
      "pdf_url": "",
      "pdf_downloaded": false,
      "pdf_path": "",
      "extracted_at": "2025-11-16T22:49:32.069863",
      "source_query": "student \"web development\"",
      "relevance_score": 1.0,
      "rank_score": 23.0
    },
    {
      "id": "13ecb3555f90f377c560c11e5a91f23f3ab72820",
      "title": "Formal concept analysis for e-learning",
      "authors": [
        "Research Online",
        "G. Beydoun"
      ],
      "year": 2017,
      "venue": "",
      "abstract": null,
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/13ecb3555f90f377c560c11e5a91f23f3ab72820",
      "doi": "",
      "bibtex": "",
      "pdf_url": "",
      "pdf_downloaded": false,
      "pdf_path": "",
      "extracted_at": "2025-11-16T22:49:32.069644",
      "source_query": "student \"web development\"",
      "relevance_score": 1.0,
      "rank_score": 22.0
    },
    {
      "id": "0d6b7722081be3203192d31472fde234ee4c4535",
      "title": "Learners’ and Educators’ Perspectives on the Value of Web Design in the South African Grade 11 Computer Applications Technology Curriculum",
      "authors": [
        "Colin Pilkington",
        "I. Sanders"
      ],
      "year": 2016,
      "venue": "",
      "abstract": null,
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/0d6b7722081be3203192d31472fde234ee4c4535",
      "doi": "10.1080/18117295.2016.1236999",
      "bibtex": "",
      "pdf_url": "",
      "pdf_downloaded": false,
      "pdf_path": "",
      "extracted_at": "2025-11-16T22:49:30.126620",
      "source_query": "student \"web design\"",
      "relevance_score": 1.0,
      "rank_score": 21.0
    },
    {
      "id": "35ec569da831f3daf198661bdf4e42cc9c65caa3",
      "title": "Stop downloading. Start uploading. Web development takes students from technology consumer to creator",
      "authors": [
        "Katie Bell"
      ],
      "year": 2016,
      "venue": "",
      "abstract": null,
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/35ec569da831f3daf198661bdf4e42cc9c65caa3",
      "doi": "",
      "bibtex": "",
      "pdf_url": "",
      "pdf_downloaded": false,
      "pdf_path": "",
      "extracted_at": "2025-11-16T22:49:30.126797",
      "source_query": "student \"web design\"",
      "relevance_score": 1.0,
      "rank_score": 21.0
    },
    {
      "id": "1311c3cf249c47b6568d7975f6461d76c4919a48",
      "title": "IMPLEMENTASI PEMBELAJARAN E-LEARNING BERBASISMOODLE PADA PROGRAM STUDI TEKNIK TELEKOMUNIKASI",
      "authors": [
        "Nash Ashahibi"
      ],
      "year": 2015,
      "venue": "",
      "abstract": null,
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/1311c3cf249c47b6568d7975f6461d76c4919a48",
      "doi": "",
      "bibtex": "",
      "pdf_url": "",
      "pdf_downloaded": false,
      "pdf_path": "",
      "extracted_at": "2025-11-16T22:49:30.126646",
      "source_query": "student \"web design\"",
      "relevance_score": 1.0,
      "rank_score": 20.0
    },
    {
      "id": "26e4586614af9aba7e53db6e0867cccf68a55824",
      "title": "Problem based e-learning system for PHP",
      "authors": [
        "Devjyoti Nath",
        "B. Chandra"
      ],
      "year": 2015,
      "venue": "",
      "abstract": null,
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/26e4586614af9aba7e53db6e0867cccf68a55824",
      "doi": "",
      "bibtex": "",
      "pdf_url": "",
      "pdf_downloaded": false,
      "pdf_path": "",
      "extracted_at": "2025-11-16T22:49:31.030145",
      "source_query": "student \"web programming\"",
      "relevance_score": 1.0,
      "rank_score": 20.0
    },
    {
      "id": "5f589a81ac6131729c84f03bc1f4d8b65a7f8753",
      "title": "Snapshots of Student Behavior During Online Learning",
      "authors": [
        "Danielle M. Geerling"
      ],
      "year": 2015,
      "venue": "",
      "abstract": null,
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/5f589a81ac6131729c84f03bc1f4d8b65a7f8753",
      "doi": "",
      "bibtex": "",
      "pdf_url": "",
      "pdf_downloaded": false,
      "pdf_path": "",
      "extracted_at": "2025-11-16T22:49:32.976486",
      "source_query": "student HTML learning OR education",
      "relevance_score": 1.0,
      "rank_score": 20.0
    },
    {
      "id": "080e03a67d424fadd2780bd0b5600ab1c2a74067",
      "title": "Application of Project-Driven Case Teaching in Dynamic Web Design Course",
      "authors": [
        "Cai Qun-ying"
      ],
      "year": 2013,
      "venue": "",
      "abstract": null,
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/080e03a67d424fadd2780bd0b5600ab1c2a74067",
      "doi": "",
      "bibtex": "",
      "pdf_url": "",
      "pdf_downloaded": false,
      "pdf_path": "",
      "extracted_at": "2025-11-16T22:49:30.126572",
      "source_query": "student \"web design\"",
      "relevance_score": 1.0,
      "rank_score": 18.0
    },
    {
      "id": "0d39e999840c15a82726e73abd1fa89aef4bb6e3",
      "title": "Application of Scaffolding Instruction in Web Design and Production Course",
      "authors": [
        "Lai Jing-hui"
      ],
      "year": 2013,
      "venue": "",
      "abstract": null,
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/0d39e999840c15a82726e73abd1fa89aef4bb6e3",
      "doi": "",
      "bibtex": "",
      "pdf_url": "",
      "pdf_downloaded": false,
      "pdf_path": "",
      "extracted_at": "2025-11-16T22:49:30.126609",
      "source_query": "student \"web design\"",
      "relevance_score": 1.0,
      "rank_score": 18.0
    },
    {
      "id": "11073f1bbaca0721a5b1369afdfd91b66a913ee7",
      "title": "Responsive Web Design Based Educational Systems Research and Construction of Mobile Platforms",
      "authors": [
        "Jiaxuan Fei"
      ],
      "year": 2013,
      "venue": "",
      "abstract": null,
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/11073f1bbaca0721a5b1369afdfd91b66a913ee7",
      "doi": "",
      "bibtex": "",
      "pdf_url": "",
      "pdf_downloaded": false,
      "pdf_path": "",
      "extracted_at": "2025-11-16T22:49:30.126634",
      "source_query": "student \"web design\"",
      "relevance_score": 1.0,
      "rank_score": 18.0
    },
    {
      "id": "30d53de09802215876b3d663e0d095e27acfea80",
      "title": "Web Based E-Learning System for C-Language",
      "authors": [
        "Lian Hong",
        "Chuanmu Li"
      ],
      "year": 2013,
      "venue": "",
      "abstract": null,
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/30d53de09802215876b3d663e0d095e27acfea80",
      "doi": "10.4028/www.scientific.net/AMM.427-429.2870",
      "bibtex": "",
      "pdf_url": "",
      "pdf_downloaded": false,
      "pdf_path": "",
      "extracted_at": "2025-11-16T22:49:31.030198",
      "source_query": "student \"web programming\"",
      "relevance_score": 1.0,
      "rank_score": 18.0
    },
    {
      "id": "44f9988f8ff46613edcbc6303ee83edafe6aad81",
      "title": "Development of a Blended Learning Model for Apprenticeship Vocational Students of Class XI in Web Programming Subjects",
      "authors": [
        "Azhar Ahmad Smaragdina",
        "S. Wibawanto"
      ],
      "year": 2013,
      "venue": "",
      "abstract": null,
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/44f9988f8ff46613edcbc6303ee83edafe6aad81",
      "doi": "",
      "bibtex": "",
      "pdf_url": "",
      "pdf_downloaded": false,
      "pdf_path": "",
      "extracted_at": "2025-11-16T22:49:31.030288",
      "source_query": "student \"web programming\"",
      "relevance_score": 1.0,
      "rank_score": 18.0
    },
    {
      "id": "0cb597b9cda8f60d61ca92f6c0696495628f1aff",
      "title": "Research on the Application of Heuristic Teaching Method in Web Development Technology Course",
      "authors": [
        "Yang Yan-li"
      ],
      "year": 2013,
      "venue": "",
      "abstract": null,
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/0cb597b9cda8f60d61ca92f6c0696495628f1aff",
      "doi": "",
      "bibtex": "",
      "pdf_url": "",
      "pdf_downloaded": false,
      "pdf_path": "",
      "extracted_at": "2025-11-16T22:49:32.069567",
      "source_query": "student \"web development\"",
      "relevance_score": 1.0,
      "rank_score": 18.0
    },
    {
      "id": "1e7bd217e5c5369be1fdeeffde74b8e4468cac41",
      "title": "Hacks and hackers in the classroom: facilitating communication and collaborative data journalism projects between journalism and web development students",
      "authors": [
        "M. Knight"
      ],
      "year": 2013,
      "venue": "",
      "abstract": null,
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/1e7bd217e5c5369be1fdeeffde74b8e4468cac41",
      "doi": "",
      "bibtex": "",
      "pdf_url": "",
      "pdf_downloaded": false,
      "pdf_path": "",
      "extracted_at": "2025-11-16T22:49:32.069704",
      "source_query": "student \"web development\"",
      "relevance_score": 1.0,
      "rank_score": 18.0
    },
    {
      "id": "12ca7c65c5e9b70c849ac3dd852221ffca180547",
      "title": "Application of “Six-states” Teaching Method in the Teaching of “Web Design”",
      "authors": [
        "Xu Hao"
      ],
      "year": 2012,
      "venue": "",
      "abstract": null,
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/12ca7c65c5e9b70c849ac3dd852221ffca180547",
      "doi": "",
      "bibtex": "",
      "pdf_url": "",
      "pdf_downloaded": false,
      "pdf_path": "",
      "extracted_at": "2025-11-16T22:49:30.126643",
      "source_query": "student \"web design\"",
      "relevance_score": 1.0,
      "rank_score": 17.0
    },
    {
      "id": "30847990d16881d89fc66dfc29bac1f1759676ff",
      "title": "Application Project Teaching Method in the\"Web Design\"Teaching",
      "authors": [
        "Huang Wufeng"
      ],
      "year": 2012,
      "venue": "",
      "abstract": null,
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/30847990d16881d89fc66dfc29bac1f1759676ff",
      "doi": "",
      "bibtex": "",
      "pdf_url": "",
      "pdf_downloaded": false,
      "pdf_path": "",
      "extracted_at": "2025-11-16T22:49:30.126771",
      "source_query": "student \"web design\"",
      "relevance_score": 1.0,
      "rank_score": 17.0
    },
    {
      "id": "36b4b2f559db980ea5bee9845795faab25331a58",
      "title": "Study on Web Design Teaching in Art Design Major of Vocational College",
      "authors": [
        "Liu Yan-yu"
      ],
      "year": 2012,
      "venue": "",
      "abstract": null,
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/36b4b2f559db980ea5bee9845795faab25331a58",
      "doi": "",
      "bibtex": "",
      "pdf_url": "",
      "pdf_downloaded": false,
      "pdf_path": "",
      "extracted_at": "2025-11-16T22:49:30.126807",
      "source_query": "student \"web design\"",
      "relevance_score": 1.0,
      "rank_score": 17.0
    },
    {
      "id": "3abdb68e899a16e568207e4d4d04aafad85ae30d",
      "title": "Practice Teaching Reform of Web Programming",
      "authors": [
        "Li Yan-ping"
      ],
      "year": 2012,
      "venue": "",
      "abstract": null,
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/3abdb68e899a16e568207e4d4d04aafad85ae30d",
      "doi": "",
      "bibtex": "",
      "pdf_url": "",
      "pdf_downloaded": false,
      "pdf_path": "",
      "extracted_at": "2025-11-16T22:49:31.030232",
      "source_query": "student \"web programming\"",
      "relevance_score": 1.0,
      "rank_score": 17.0
    },
    {
      "id": "5b1b3ea20858593e7ff629c32c90823d9ab5386f",
      "title": "wProjects : Dynamic Web Development Projects for Female High School Students",
      "authors": [
        "Elizabeth Thiry",
        "M. Rosson"
      ],
      "year": 2012,
      "venue": "",
      "abstract": null,
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/5b1b3ea20858593e7ff629c32c90823d9ab5386f",
      "doi": "",
      "bibtex": "",
      "pdf_url": "",
      "pdf_downloaded": false,
      "pdf_path": "",
      "extracted_at": "2025-11-16T22:49:31.030371",
      "source_query": "student \"web programming\"",
      "relevance_score": 1.0,
      "rank_score": 17.0
    },
    {
      "id": "0fc8ce4e71d21ffc5559b5297b76fc727d61a7da",
      "title": "On Teaching Reform of Java Web Development Course in Higher Vocational Software Major",
      "authors": [
        "Wang Hong-lei"
      ],
      "year": 2012,
      "venue": "",
      "abstract": null,
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/0fc8ce4e71d21ffc5559b5297b76fc727d61a7da",
      "doi": "",
      "bibtex": "",
      "pdf_url": "",
      "pdf_downloaded": false,
      "pdf_path": "",
      "extracted_at": "2025-11-16T22:49:32.069591",
      "source_query": "student \"web development\"",
      "relevance_score": 1.0,
      "rank_score": 17.0
    },
    {
      "id": "2719e21294dfecf7f227c458c4d95722c6389bff",
      "title": "Discussion on the Education of the Most Sought-after Skill in Web Development: Framework Knowledge",
      "authors": [
        "Jianhong Sun",
        "Qun Cai",
        "Yingjiang Li"
      ],
      "year": 2012,
      "venue": "",
      "abstract": null,
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/2719e21294dfecf7f227c458c4d95722c6389bff",
      "doi": "10.1007/978-3-642-28655-1_89",
      "bibtex": "",
      "pdf_url": "",
      "pdf_downloaded": false,
      "pdf_path": "",
      "extracted_at": "2025-11-16T22:49:32.069798",
      "source_query": "student \"web development\"",
      "relevance_score": 1.0,
      "rank_score": 17.0
    },
    {
      "id": "0c6b85c564221d7b82aa605addb13e545d8182ee",
      "title": "On Website Plan and Courses Reform",
      "authors": [
        "Li Qiang"
      ],
      "year": 2011,
      "venue": "",
      "abstract": null,
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/0c6b85c564221d7b82aa605addb13e545d8182ee",
      "doi": "",
      "bibtex": "",
      "pdf_url": "",
      "pdf_downloaded": false,
      "pdf_path": "",
      "extracted_at": "2025-11-16T22:49:30.126606",
      "source_query": "student \"web design\"",
      "relevance_score": 1.0,
      "rank_score": 16.0
    },
    {
      "id": "23c84f1cf7b7cdb6f38c360feb93f8aea504d275",
      "title": "Picture Photography and Editing Learning Website Design Strategy",
      "authors": [
        "Wang Xiu-ling"
      ],
      "year": 2011,
      "venue": "",
      "abstract": null,
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/23c84f1cf7b7cdb6f38c360feb93f8aea504d275",
      "doi": "",
      "bibtex": "",
      "pdf_url": "",
      "pdf_downloaded": false,
      "pdf_path": "",
      "extracted_at": "2025-11-16T22:49:30.126715",
      "source_query": "student \"web design\"",
      "relevance_score": 1.0,
      "rank_score": 16.0
    },
    {
      "id": "2caf51c4e3c7e42d8823dfae1791af69b461cbd2",
      "title": "The Influence Capability of Mathematics and English Language Learning Achievement Against Web Design Students Subject SMK 3 Yogyakarta School Year 2010/2011",
      "authors": [
        "Lukman Affandi"
      ],
      "year": 2011,
      "venue": "",
      "abstract": null,
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/2caf51c4e3c7e42d8823dfae1791af69b461cbd2",
      "doi": "",
      "bibtex": "",
      "pdf_url": "",
      "pdf_downloaded": false,
      "pdf_path": "",
      "extracted_at": "2025-11-16T22:49:30.126752",
      "source_query": "student \"web design\"",
      "relevance_score": 1.0,
      "rank_score": 16.0
    },
    {
      "id": "3120d187efd2e6f52c794aca7708da4b9dbf8949",
      "title": "Improve Web Design Curriculum Teaching of Art Professional with the Development Trend",
      "authors": [
        "Xie Tao"
      ],
      "year": 2011,
      "venue": "",
      "abstract": null,
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/3120d187efd2e6f52c794aca7708da4b9dbf8949",
      "doi": "",
      "bibtex": "",
      "pdf_url": "",
      "pdf_downloaded": false,
      "pdf_path": "",
      "extracted_at": "2025-11-16T22:49:30.126777",
      "source_query": "student \"web design\"",
      "relevance_score": 1.0,
      "rank_score": 16.0
    },
    {
      "id": "312f3e58bb4596f13bb2af0d32a0a18b70a1d914",
      "title": "By \"Speaking Lesson\" the Form Expounds the Teaching of Higher Vocational \"ASP.NET Dynamic Web Design\" Course",
      "authors": [
        "Xu Zhao-xing"
      ],
      "year": 2011,
      "venue": "",
      "abstract": null,
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/312f3e58bb4596f13bb2af0d32a0a18b70a1d914",
      "doi": "",
      "bibtex": "",
      "pdf_url": "",
      "pdf_downloaded": false,
      "pdf_path": "",
      "extracted_at": "2025-11-16T22:49:30.126782",
      "source_query": "student \"web design\"",
      "relevance_score": 1.0,
      "rank_score": 16.0
    },
    {
      "id": "0555d89de17f69102f90f62b3878090bdcc98e87",
      "title": "ELEARNING WEBSITE MAKING LANGUAGES C USING PHP AND MYSQL",
      "authors": [
        "H. Saputra",
        "Fitrianingsih Fitrianingsih"
      ],
      "year": 2011,
      "venue": "",
      "abstract": null,
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/0555d89de17f69102f90f62b3878090bdcc98e87",
      "doi": "",
      "bibtex": "",
      "pdf_url": "",
      "pdf_downloaded": false,
      "pdf_path": "",
      "extracted_at": "2025-11-16T22:49:31.030059",
      "source_query": "student \"web programming\"",
      "relevance_score": 1.0,
      "rank_score": 16.0
    },
    {
      "id": "418c4f614b8459aa42b621cd05ee6455e8c808c6",
      "title": "MAKING MATERIAL MECHANICS E-LEARNING APPLICATIONS USING PHP AND MYSQL.",
      "authors": [
        "Merta Riza",
        "J. Widjajakusuma"
      ],
      "year": 2011,
      "venue": "",
      "abstract": null,
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/418c4f614b8459aa42b621cd05ee6455e8c808c6",
      "doi": "",
      "bibtex": "",
      "pdf_url": "",
      "pdf_downloaded": false,
      "pdf_path": "",
      "extracted_at": "2025-11-16T22:49:31.030275",
      "source_query": "student \"web programming\"",
      "relevance_score": 1.0,
      "rank_score": 16.0
    },
    {
      "id": "0347c1c8f41490f1ae4612f1aad0a636062d29f7",
      "title": "Practice and Design of Web Development Course Practice Teaching Based on Working-Learning Integration",
      "authors": [
        "M. Rong-fei"
      ],
      "year": 2011,
      "venue": "",
      "abstract": null,
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/0347c1c8f41490f1ae4612f1aad0a636062d29f7",
      "doi": "",
      "bibtex": "",
      "pdf_url": "",
      "pdf_downloaded": false,
      "pdf_path": "",
      "extracted_at": "2025-11-16T22:49:32.069471",
      "source_query": "student \"web development\"",
      "relevance_score": 1.0,
      "rank_score": 16.0
    },
    {
      "id": "34e8dfea5e5356b24e6fc32fed3d1f90aecc2f76",
      "title": "MAKING Student WEBSITE OF SMA N 8 BOGOR USING MACROMEDIA DREAMWEAVER 8, PHP AND MYSQL",
      "authors": [
        "Nur Andika Rachman"
      ],
      "year": 2011,
      "venue": "",
      "abstract": null,
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/34e8dfea5e5356b24e6fc32fed3d1f90aecc2f76",
      "doi": "",
      "bibtex": "",
      "pdf_url": "",
      "pdf_downloaded": false,
      "pdf_path": "",
      "extracted_at": "2025-11-16T22:49:32.069924",
      "source_query": "student \"web development\"",
      "relevance_score": 1.0,
      "rank_score": 16.0
    },
    {
      "id": "0d6665bce080bb3a4137629a4a1156bb26f5b1f9",
      "title": "Development and Construction of Project Course on Business Web Design and Production",
      "authors": [
        "Zhang Xue-qin"
      ],
      "year": 2010,
      "venue": "",
      "abstract": null,
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/0d6665bce080bb3a4137629a4a1156bb26f5b1f9",
      "doi": "",
      "bibtex": "",
      "pdf_url": "",
      "pdf_downloaded": false,
      "pdf_path": "",
      "extracted_at": "2025-11-16T22:49:30.126615",
      "source_query": "student \"web design\"",
      "relevance_score": 1.0,
      "rank_score": 15.0
    },
    {
      "id": "244c7a4736847dd6a15873a57509f0e5605301fe",
      "title": "Discussion of the Project Approach in the \"HTML Web Design\" Teaching Application",
      "authors": [
        "Ouyang Fang"
      ],
      "year": 2010,
      "venue": "",
      "abstract": null,
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/244c7a4736847dd6a15873a57509f0e5605301fe",
      "doi": "",
      "bibtex": "",
      "pdf_url": "",
      "pdf_downloaded": false,
      "pdf_path": "",
      "extracted_at": "2025-11-16T22:49:30.126718",
      "source_query": "student \"web design\"",
      "relevance_score": 1.0,
      "rank_score": 15.0
    },
    {
      "id": "2c75677ac8c71ea3aedd74ca7707f2bfebc7d0c4",
      "title": "On JavaScript Case Teaching in Higher Vocational Colleges",
      "authors": [
        "Shen Yi"
      ],
      "year": 2010,
      "venue": "",
      "abstract": null,
      "citations": 0,
      "url": "https://www.semanticscholar.org/paper/2c75677ac8c71ea3aedd74ca7707f2bfebc7d0c4",
      "doi": "",
      "bibtex": "",
      "pdf_url": "",
      "pdf_downloaded": false,
      "pdf_path": "",
      "extracted_at": "2025-11-16T22:49:30.126749",
      "source_query": "student \"web design\"",
      "relevance_score": 1.0,
      "rank_score": 15.0
    }
  ]
}